#Списки


#Списки - упорядоченные изменяемые коллекции, которые хранят элементы любых типов данных

#В split() можно указывать аргументы, по которым будет делиться наша строка, по умолчанию пробел

#Если брать срезы у списка, то создается новый список со своим id

print("Работа со срезами:")
list1 = list(range(1, 10))
list2 = list1[1:5]
print(f"ID первого неизменненого списка - {id(list1)}")
print(f"ID того же списка со срезом - {id(list2)}\n\n")

#print([1, 2, 3][10:]) - []
#print([1, 2 ,3][-2:]) - [2, 3]

# remove("") - Удаляет первое вхождение элемента в списке, после чего индексы меняются в списке
# pop() - По умолчанию забирает и возвращает последний элемент, а так же может принимать в себя индекс
# .sort() - сортирует по неубыванию, можно указать аргумент (reverse=True), возвращает None
# .reverse() - Переворачивает список, возвращает None
# .clear() - Удаляет все элементы из списка

#Копирование списков
print("Копирование списков:")
a = list(range(1, 3))
b = a

print(f"a - {a}")
print(f"b = a - {b}")
print("a.append(100)")
print("b.append(200)")

a.append(100)
b.append(200)

print(f"a - {a}")
print(f"b - {b}")

# .copy() возвращает независимую копию списка, но внутри элементы указывают на те же элементы
# list2 = list(list1))
# list2 = list[:]

# Для полного копирования используем библиотеку copy и метод deepcopy()




